app/controllers/categories_controller.rb

INSERT INTO "categories" ("name") VALUES (?)  [["name", "sdfsd"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save