app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("description", "title", "url") VALUES (?, ?, ?)  [["description", "testing"], ["title", "test"], ["url", "test url"]]